workbook/normalization_report.tex
% Created 2026-03-02 Mon 17:46
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Elijah Zimmerman}
\date{\today}
\title{Normalization Report}
\hypersetup{
 pdfauthor={Elijah Zimmerman},
 pdftitle={Normalization Report},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.34)}, 
 pdflang={English}}
\usepackage{biblatex}

\begin{document}

\maketitle
\tableofcontents

\section{Functional Dependencies}
\label{sec:org188c1d5}
\subsection{Inventory Tables}
\label{sec:org25f1dca}
\subsubsection{Product}
\label{sec:orgdc616a9}
upc: preferred\textsubscript{supplier}, sku, price, quantity, location, minimum\textsubscript{quantity}

This table is BCNF because each attribute is defined by the upc.
\subsubsection{Supplier}
\label{sec:orgf809270}
supplier\textsubscript{id}: name, phone\textsubscript{number}

This table is BCNF because name and phone number are defined by supplier id.
\subsubsection{Product Supplied}
\label{sec:orgf695356}
upc, supplier\textsubscript{id}: price\textsubscript{per}\textsubscript{unit}, lead\textsubscript{time}, shipping\textsubscript{cost}

Swapped total\textsubscript{price}, which depended on price\textsubscript{per}\textsubscript{unit}, for shipping cost to satisfy 3NF.
This table is BCNF because each item from a given supplier may have a different price, lead time, and shipping cost.
\subsection{Warehouse Tables}
\label{sec:orgafdc798}
\subsubsection{Shipment}
\label{sec:org044e952}
shipment\textsubscript{id}: received\textsubscript{by}, date\textsubscript{created}, time\textsubscript{created}, date\textsubscript{arrived}, time\textsubscript{arrived}, total\textsubscript{cartons}

This table is BCNF because each shipment's attributes are dependent only on shipment\textsubscript{id}.
\subsubsection{Product Shipped}
\label{sec:org341226b}
shipment\textsubscript{id}, product\textsubscript{id}, supplier\textsubscript{id}: quantity

This table is BCNF because quantity is tracked separately for products from different suppliers and in different shipments.
\subsection{Employee Management Tables}
\label{sec:org84f16f6}
\subsubsection{Employee}
\label{sec:orgce595b7}
employee\textsubscript{num}: first\textsubscript{name}, last\textsubscript{name}

Removed role\textsubscript{id} as it is not dependent on any candidate key and thus violates 3NF.
This table is BCNF because name is dependent on employee number.
\subsubsection{Role Tables (overlap)}
\label{sec:org307e15e}
These three tables are in BCNF because there is only the primary key.
\begin{enumerate}
\item Stocker
\label{sec:orge5eb56d}
employee\textsubscript{num}
\item Cashier
\label{sec:org36e0299}
employee\textsubscript{num}
\item Manager
\label{sec:org13e0f02}
employee\textsubscript{num}
\end{enumerate}
\subsubsection{Pay Modality Tables (disjoint)}
\label{sec:orge2d6fd8}
These two tables are in BCNF because all dependencies rely only on the entire primary key.
\begin{enumerate}
\item Hourly
\label{sec:org1bd20f4}
employee\textsubscript{num}: rate
\item Salary
\label{sec:org8a748c8}
employee\textsubscript{num}: amount
\end{enumerate}
\subsection{Register Tables}
\label{sec:orga4019dc}
\subsubsection{Sale}
\label{sec:org90c2649}
receipt\textsubscript{num}: date, time, cashier

Removed total\textsubscript{sale} due to dependency on Product Sold table.
This table is BCNF because date, time, and cashier depend only on receipt number.
\subsubsection{Product Sold}
\label{sec:org9615a18}
upc, receipt\textsubscript{num}: sale\textsubscript{price}

This table is BCNF because the sale price for each item is uniquely determined by upc and receipt number.
\subsubsection{Discount Tables}
\label{sec:orge14568e}
\begin{enumerate}
\item Transaction Discount
\label{sec:org368356d}
receipt\textsubscript{num}: authorizer, discount\textsubscript{amount}

This table is BCNF because a transaction discount applies to the whole receipt.
\item Line Discount
\label{sec:orgd490a8e}
upc, receipt\textsubscript{num}: authorizer, discount\textsubscript{amount}

This table is BCNF because a line discount applies to a specific item.
\end{enumerate}
\end{document}
